[
{
"artist": "The Notorious B.I.G.",
"title": "Ready to Die",
"overview": "Ready to Die was released to critical acclaim and became a commercial success, achieving gold certification. In 1995, after the release, the album became a certified double platinum by the Recording Industry Association of America (RIAA), and the album has reached a certified quadruple platinum with sales. It was significant for revitalizing the East Coast hip hop scene, amid West Coast hip hop's commercial dominance. The album's second single, 'Big Poppa', was nominated for a Grammy Award for Best Rap Solo Performance at the 1996 Grammy Awards. Ready to Die has been regarded by many music critics as one of the greatest hip-hop albums of all time. In 2003, it was ranked number 133 on Rolling Stone magazine's list of the 500 greatest albums of all time, making it the third highest hip hop album on the list after It Takes a Nation of Millions to Hold Us Back and Raising Hell. In 2006, Time included it on their list of the 100 greatest albums of all time.",
"ranking": 0,
"upvote": 0
},
{
"artist": "Coheed and Cambria",
"title": "The Second Stage Turbine Blade",
"overview": "The album introduces the husband and wife characters Coheed and Cambria, the characters from whom the band's name originates. This album is one of three Coheed and Cambria albums (the others being Year of the Black Rainbow and the non-conceptual The Color Before the Sun) not to have a multi-part suite, as In Keeping Secrets of Silent Earth: 3 had the 'Camper Velourium' series, Good Apollo, I'm Burning Star IV, Volume One: From Fear Through the Eyes of Madness had the 'Willing Well' series, Good Apollo, I'm Burning Star IV, Volume Two: No World for Tomorrow had the 'End Complete' series, and The Afterman: Ascension and Descension albums have the 'Key Entity Extraction' series. Lead singer Claudio Sanchez has said the 'Turbine Blade' referred to in the title of the album comes from the fact that his father worked in a factory making turbine blades",
"ranking": 0,
"upvote": 0
},
{
"artist": "Social Distortion",
"title": "Social Distortion",
"overview": "Social Distortion is the eponymous third studio album by the American punk rock band Social Distortion, released on March 27, 1990 through Epic Records, their first recording on that label. The album furthered the rockabilly, blues and country music experimentation of their previous album with songs like 'Drug Train' and the radio hit 'Ball and Chain'. The focus on the alternative rock scene helped bring attention to Social Distortion. The singles 'Story of My Life' and 'Ball and Chain' were able to find an audience on alternative rock radio and on MTV. Social Distortion was one of the band's most successful albums to date, and their first to enter the Billboard 200; the release peaked at number 128. The album has been certified gold by the RIAA in the United States. By 1996, Social Distortion had sold at least 250,000 copies, becoming the band's second best-selling album in the United States (their next album Somewhere Between Heaven and Hell sold 296,000 copies).",
"ranking": 0,
"upvote": 0
}
]