app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "updated_at", "title", "artist", "description") VALUES (?, ?, ?, ?, ?)  [["created_at", 2016-07-21 07:31:47 UTC], ["updated_at", 2016-07-21 07:31:47 UTC], ["title", "Apple"], ["artist", ""], ["description", ""]]