app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "updated_at", "title", "author", "description") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "Yay for books"], ["updated_at", 2016-07-21 06:30:44 UTC], ["id", 10]]