app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(rank: :desc).all
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."rank" DESC

  def create
    @movie = Movie.create(movie_params[:movie])
---
INSERT INTO "movies" ("created_at", "updated_at", "title", "director", "description") VALUES (?, ?, ?, ?, ?)  [["created_at", 2016-07-21 07:42:40 UTC], ["updated_at", 2016-07-21 07:42:40 UTC], ["title", ""], ["director", ""], ["description", ""]]

  def destroy
    @movie = Movie.find(params[:id]).delete
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 10]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]